Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateMiddleStringer Property
 Can't create one or more Middle Stringers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateMiddleStringer { get; }
Public Shared ReadOnly Property CannotCreateMiddleStringer As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateMiddleStringer {
	FailureDefinitionId^ get ();
}
static member CannotCreateMiddleStringer : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace